/* ...
   403 statu scode graph */
"Acces token isn't right, please login" = "Acces token is niet goed, log opnieuw in";

/* geeen comment */
"Account is signed out" = "uit gelogd";

/* contentview state Add to Calendar */
"Add to Calendar" = "Voeg toe aan kalender";

/* contentview Added to Calendar */
"Added to Calendar" = "Toegevoegd aan kalender";

/* kon niet stil een token halen */
"Could not acquire token silently: \(error)" = "Kon de token niet krijgen zonder interactie: \(error)";

/* geen token error loginmodal */
"Could not acquire token: \(error)" = "Kon de token niet krijgen: \(error)";

/* geen result bij getToken
   geen token error loginmodal */
"Could not acquire token: No result returned" = "Kon de token niet krijgen geen resultaat terug gegeven";

/* bij /me
   verkeerde fromat json */
"Couldn't deserialize result JSON" = "Kon niet JSON serialiseren";

/* bij /photo */
"Couldn't get graph photo: \(error)" = "Kon niet de profiel foto krijgen: \(error)";

/* geen grapp resault
   graph error bij /me */
"Couldn't get graph result: \(error)" = "Kon niet het graph result: \(error)";

/* kon geen accoutn vinden */
"Couldn't query current account with error: \(error)" = "Couldn't query current account with error: \(error)";

/* modal */
"Couldn't sign out account: \(error)" = "Couldn't sign out account: \(error)";

/* bij /me */
"Er was geen data bij het reqeust naar de graph" = "Er was geen data bij het reqeust naar de graph";

/* er was een fout bij init MsAuthManger */
"Error At init \(error)" = "Error bij het initialiseren van de AuthManger met: \(error)";

/* contentview Failed to add to Calendar */
"Failed to add to Calendar" = "Toevoegen aan agenda mislukt";

/* auccount gevond met user name */
"Found a signed in account \(currentAccount.username ?? geenNaamString)" = "Found a signed in account \(currentAccount.username ?? geenNaamString)";

/* Geen location CalendarView */
"No Location" = "Geen Location";

/* in auth MsAuthManger */
"No user name" = "Geen gebruikers naam";

/* LoginViewController get token */
"No username" = "No gebruikers naame";

/* modal */
"Sign out completed successfully" = "Uitloggen was successvol";

/* signed in user loginmodal */
"Signed in an account \(result.account.username ?? NoUserName)." = "Account \(result.account.username ?? NoUserName) is ingelogd.";

/* Er was een error met de graph: \(GraphError.error.message) */
"there was an error with the graph: \(GraphError.error.message)" = "Er was een error met de graph: \(GraphError.error.message)";

/* Er was geen data bij het reqeust naar /calender met error: \(String(describing: error?.localizedDescription)) */
"there was no data with reqeust to /calender with error: \(String(describing: error?.localizedDescription))" = " Er was geen data bij het reqeust naar /calender met error: \(String(describing: error?.localizedDescription))";

/* knop */
"Microsoft Login Button" = "Microsoft Login knop";

/* knop */
"Microsoft LogOut Button" = "Microsoft Loguit knop";
